// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)

// let calcSum = (...nums) => {
//   let min = nums[0];
//     for (const num of nums) {
//         if (min > num){
//             min = num
//         }
//     }
//     console.log(min);
// }
// calcSum(100,-100,1000);




// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)


// let calcSum = function (...nums){
//     let max = nums[0];
//     for (const max1 of nums) {
//         if (max < max1){
//             max = max1;
//         }
//
//     }
//
//         console.log(max);
//
// }
// calcSum(10, 1000,1);

//

// - створити функцію яка повертає найбільше число з масиву


//
//  let numbers = [188,55,1887];
//
// let max = numbers[0];
//
// function sortNUm(){
//     for (const num of numbers) {
//         if (max < num){
//             max = num;
//         }
//     }
//     console.log(max)
//
// }
// sortNUm()

////////////////////////////////////////////////////////////////////
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// let numbers = [155,55,555];
//
// let searchSum = function (...nums) {
// let middleSum = nums[0];
//     for (const middleSumElement of nums) {
//         if ((a + b + c) / nums.length){
//             middleSum = middleSumElement
//     }
//
// }
//     return middleSum;
//
// }
// console.log(searchSum(10, 20, 30));


// ??????????????????????????????????????????????????????????????????



/////////////////////////////////////////////////////////////////////
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
// (Math використовувати заборонено);




// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
    let array = [];

let num = function generateNum() {

   let res = 0;
    for (let i = 0; i < 100; i++) {
       let x = Math.floor(Math.random() * 100)
       array.push(x)

    }

    console.log(x)
}
num






// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
//
//
//
//
// - створити функцію, яка якщо приймає один аргумент, просто вивдоить його, якщо два аргументи - складає або конкатенує їх між собою.
//
// - створити функцію  яка приймає два масиви та скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//     EXAMPLE:
// [1,2,3,4]
//     [2,3,4,5]
// результат
//     [3,5,7,9]
//
// - Створити функцію яка приймає масив будь яких объектів, та повертає масив ключів всіх обєктів
// EXAMPLE:
//     [{name: 'Dima', age: 13}, {model: 'Camry'}]  ===> [ name, age, model ]
//
//     - Створити функцію яка приймає масив будь яких объектів, та повертає масив значень всіх обєктів
// EXAMPLE:
//     [{name: 'Dima', age: 13}, {model: 'Camry'}]  ===> [ Dima, 13, Camry ]
