// - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//     за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy
// (хибноподыбне, тобто кастується до false)

let x = NaN ||'default' ;
console.log(x);








// В фул чаті писали що має робитись через if
// let x = null;
//
// if ( !x || " ohya" )
//     console.log('default')
//






// це другий вар

// let x = null;
//
// if ( x || !null ) {
//     console.log('default')
// }



